Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/employment/migrant_workers/finding_a_job_when_you_move_to_ireland.html.txt.tmx
Source language: en
Languages: pl

source: Finding a job in Ireland
pl: Jak znalezc prace w Irlandii

source: If you are moving to Ireland or considering re-locating here, finding a job is probably going to be one of your priorities
pl: Osoby wyjeżdżające lub przeprowadzające się do Irlandii, muszą uwzględnić aspekt znalezienia pracy

source: It is advisable to have employment and possibly some accommodation organised in advance of your journey but it is not a requirement
pl: Przed przyjazdem tutaj wskazane jest zorganizowanie sobie wcześniej zatrudnienia i zakwaterowania, ale nie jest to konieczne

source: If you are planning to move country, it makes sense to do some research into the opportunities available here, the average rates of pay and taxation issues and to ensure there are no restrictions that would preclude you from working here
pl: Przy planowaniu zmiany kraju zamieszkania, warto zebrać informacje na temat tutejszych możliwości, średnich płac i spraw podatkowych i upewnić się, czy nie ma tu żadnych ograniczeń uniemożliwiających pracę

source: The Citizens Information website does not carry any information about job vacancies for any sector of the Irish economy
pl: CitizensInformation.ie nie zbiera informacji na temat wolnych miejsc pracy w żadnym sektorze gospodarki Irlandii

source: It does not accept CVs/resumes and cannot forward them to employers on your behalf
pl: CitizensInformation.ie nie przyjmuje CV/życiorysów i nie przesyła ich w imieniu danej osoby do pracodawców

source: Recruitment agencies in Ireland offer a wide range of employment opportunities - from casual employment to specialised skills - see 'Where to apply' below
pl: Istnieje cały szereg agencji rekrutacyjnych w Irlandii, które dostarczają informacje o pracy w Irlandii (por. poniżej w części "Gdzie składać podanie")

source: This document will provide you with information and advice about coming to work in Ireland and your rights when finding and securing a job as a foreign national employee in Ireland
pl: Niniejszy dokument przedstawia informacje i porady na temat praw pracowniczych przysługujących w trakcie szukania i zapewnienia sobie zatrudnienia osobom niebędącym obywatelami Irlandii

source: Quality and Qualifications Ireland is the Irish centre for the recognition of international qualifications
pl: Narodowy Urząd ds. Kwalifikacji (Quality and Qualifications Ireland) to irlandzkie centrum zajmujące się potwierdzaniem kwalifikacji pracowników zagranicznych, znane jako Potwierdzanie kwalifikacji (Qualifications Recognition)

source: It has an International Qualifications Database
pl: W centrum znajduje się Międzynarodowa baza danych kwalifikacji pracowników

source: You need to know about how qualifications are recognised in Ireland and about the mutual recognition of professional qualifications
pl: Należy zapoznać się ze sposobem potwierdzania kwalifikacji w Irlandii oraz wzajemnego potwierdzania kwalifikacji zawodowych

source: If you have a professional qualification, you should check with the Irish branch of your professional body as to whether your qualifications are acceptable for use in Ireland - see 'Professions and careers' below
pl: W przypadku posiadania kwalifikacji zawodowych, należy sprawdzić w irlandzkiej organizacji zawodowej właściwej dla danego zawodu, czy takie kwalifikacje zostaną zaakceptowane w Irlandii — patrz poniższy rozdział „Zawód i praca umożliwiająca rozwój zawodowy”

source: If you are an EEA or Swiss national coming to work in Ireland, you are entitled to be treated like any other applicant when you apply for work
pl: Kandydaci pochodzący z Europejskiego Obszaru Gospodarczego i Szwajcarii, którzy przyjechali z UE do pracy w Irlandii, mają takie same prawa podczas procesu rekrutacji, jak inni kandydaci

source: You are free to apply for any job vacancy, including jobs in the public sector
pl: Istnieje możliwość ubiegania się o dowolną pracę, nawet w sektorze publicznym

source: These include jobs in the Irish army and the Irish police force (An Garda Síochána), but not the Irish diplomatic service
pl: Dostępne są wolne stanowiska w irlandzkich siłach zbrojnych i irlandzkiej policji (An Garda Síochána), lecz niestety nie w irlandzkich służbach dyplomatycznych

source: Note: the EEA (European Economic Area) comprises the European Union (EU) member states, Norway, Iceland and Liechtenstein
pl: Uwaga: Europejski Obszar Gospodarczy obejmuje kraje członkowskie Unii Europejskiej, Norwegię, Islandię i Liechtenstein

source: European Employment Services (EURES)
pl: Europejskie Służby ds. Zatrudnienia (EURES)

source: Citizens of the EU/EEA are free to live and work in other member states without restriction
pl: Obywatele UE/EOG mają prawo do swobodnego zamieszkania i pracy w innych Państwach Członkowskich bez ograniczeń

source: To facilitate the free movement of workers between member states, the EURES network consisting of the public employment service and the European Commission in each country has been established
pl: Aby ułatwić swobodny przepływ pracowników pomiędzy Państwami Członkowskimi, utworzono sieć składającą się z publicznej służby ds. zatrudnienia z inicjatywy Komisji Europejskiej w każdym z tych państw

source: • Provide a European Job Placement Services for jobseekers
pl: • świadczenie usług w zakresie znalezienia pracy w Europie osobom poszukującym pracy,

source: • Offer advice and guidance on how to look for a job in the EEA and the possibilities that exist for finding work in another country
pl: • oferowanie rad i wskazówek w zakresie poszukiwania pracy w EOG oraz oferowanie istniejących możliwości znalezienia zatrudnienia w innym kraju,

source: • Provide a recruitment service to employers who wish to recruit in EEA member states
pl: • świadczenie usług rekrutacyjnych dla pracodawców, którzy pragną prowadzić rekrutację w Państwach Członkowskich EOG,

source: • Provide information on living and working conditions in EEA member states
pl: • dostarczanie informacji na temat warunków mieszkaniowych i pracy w Państwach Członkowskich EOG

source: Within each EU/EEA member state, specially trained placement officers (called EURES Advisers) provide free information and advice to workers and employers about all of the above issues
pl: W każdym Państwie Członkowskim UE/EOG, specjalnie przeszkoleni pracownicy ds. zatrudnienia, zwani Doradcami Eures, udostępniają darmowe informacje i orady dla pracowników i pracodawców na wszystkie ww. tematy

source: EEA jobseekers who wish to work in another member state will obtain information on jobs and information on living/working conditions in the EEA here
pl: Osoby poszukujące pracy w EOG, które chciałyby pracować w innym Państwie Członkowskim uzyskają tutaj informacje o stanowiskach pracy i warunkach mieszkaniowych/pracy w EOG

source: If you are looking for work, you can also post your CV on the EURES website where it can be accessed by thousands of employers throughout the EEA
pl: Osoby poszukujące pracy mogą również umieścić swoje CV na stronie internetowej EURES, które będzie udostępnione tysiącom pracodawców z EOG

source: This will help maximise your chances of securing employment
pl: Zwiększy to szansę na znalezienie zatrudnienia

source: From 12 October 2007 non-EEA nationals who are carrying out scientific research for approved research organisations do not need an employment permit
pl: Wszyscy kandydaci spoza Europejskiego Obszaru Gospodarczego muszą posiadać pozwolenie na pracę, aby móc pracować w Irlandii. Z dniem 1 lutego 2007 r

source: The arrangements for employment permits include:
pl: weszły w życie nowe zasady dotyczące pozwoleń na pracę, które obejmują:

source: • Critical Skills Employment Permits which are available for all occupations with an annual salary above €60,000 and for a restricted range of occupations with an annual salary above €30,000
pl: • Zielone Karty, dostępne dla wszystkich zawodów z roczną kwotą wynagrodzenia przekraczającą 60,000 EUR oraz dla ograniczonej liczby zawodów z wynagrodzeniem powyżej 30,000 i 60,000 EUR

source: • General Employment Permits which are available mainly for occupations with salaries between €30,000 and €60,000 which are not eligible for a Critical Skills Employment Permit
pl: • Pozwolenia na pracę, dostępne dla zawodów z roczną kwotą wynagrodzenia na poziomie od 30,000 do €60,000 EUR, w przypadku których Zielona Karta nie przysługuje

source: The General Employment Permit application must meet a labour market test showing that the position could not be filled from within the EEA
pl: Podanie o pozwolenie na pracę musi byś zgodne z badaniami rynku pracy, które potwierdzają, że na tym stanowisku nie może być zatrudniony kandydat z Europejskiego Obszaru Gospodarczego

source: Your nearest Irish embassy or consulate will be able to advise on whether you require a travel visa before coming to Ireland
pl: W najbliższej irlandzkiej placówce dyplomatycznej można uzyskać informacje na temat konieczności złożenia wniosku o wizę przed przyjazdem do Irlandii

source: These jobs are often advertised in shop windows, in shopping centres, through daily Irish newspapers and through employment agencies
pl: Ogłoszenia dotyczące takich prac można często znaleźć na witrynach sklepowych, w centrach handlowych, codziennej prasie irlandzkiej i agencjach pracy

source: While many of these jobs do not require any specific professional qualifications, it is advisable to bring evidence of any educational standards (such as secondary school certificates, diplomas, and degrees) you have attained with you to Ireland
pl: Mimo, że wiele z tych prac nie wymaga żadnych konkretnych zawodowych kwalifikacji, wskazane jest przedstawienie zaświadczenia o wykształceniu (tzn. świadectwa szkoły średniej, dyplomów, stopni naukowych, itd.) przywiezionych do Irlandii

source: It is also useful to bring an up-to-date résumé/CV in the English language with you as you may be requested to supply information on any experience or expertise you may have
pl: Warto również przywieźć ze sobą aktualny życiorys/CV w języku angielskim, ponieważ może zaistnieć potrzeba przedstawienia informacji na temat doświadczenia i wiedzy merytorycznej

source: If you are planning to come to Ireland and are seeking casual employment, you could register with a recruitment agency in advance of your journey
pl: Planując przyjazd do Irlandii i poszukiwanie pracy tymczasowej, można przed podróżą zarejestrować się w agencji rekrutacyjnej

source: You should also keep an eye on advertisements for casual workers in shops/stores
pl: Osoby poszukujące pracy powinny również bacznie śledzić ogłoszenia dla poszukujących pracy tymczasowej w sklepach/domach handlowych

source: Finding a career job in Ireland will involve a little more planning than looking for casual work
pl: Znalezienie pracy związanej rozwojem zawodowym w Irlandii będzie wymagało nieco więcej planowania niż szukanie pracy tymczasowej

source: While a career job may take a little longer to secure, you are advised get organised and start applying for jobs before you travel
pl: Mimo, że zapewnienie sobie rozwoju zawodowego może potrwać dłużej, lepiej załatwić wszystkie sprawy organizacyjne i zacząć ubiegać się o pracę przed przyjazdem

source: It is also useful to bear in mind that these jobs are generally paid at a higher level than other jobs that do not require any qualifications
pl: Warto wziąć pod uwagę, że praca profesjonalna jest zazwyczaj lepiej płatna niż prace niewymagające żadnych kwalifikacji

source: Almost all professions in Ireland have associations or societies in Ireland that represent and often regulate their members
pl: Prawie dla wszystkich zawodów w Irlandii istnieją irlandzkie związki zawodowe lub stowarzyszenia reprezentujące swoich członków i często regulujące ich prawa

source: These associations will provide information on recognition of professional qualifications, employment opportunities and careers
pl: Stowarzyszenia takie dostarczą informacji o uznaniu kwalifikacji zawodowych, możliwościach zatrudnienia i rozwoju zawodowego

source: Almost all of these organisations have their own websites (pdf), which you can search for online using any good search engine
pl: Niemal każda z tych organizacji posiada własną stronę internetową (pdf), którą można znaleźć w sieci używając dobrej wyszukiwarki

source: All employees, irrespective of their nationality, experience, expertise or profession, are protected by the law in Ireland
pl: Wszyscy pracownicy w Irlandii, niezależnie od narodowości, doświadczenia, wiedzy zawodowej czy zawodu są chronieni przez irlandzkie prawo

source: These laws set down specific rules about minimum rates of pay, working hours, leave, health and safety, changing jobs and employment rights
pl: Prawo to określa szczegółowe zasady dotyczące minimalnych stawek wynagrodzenia, godzin pracy, urlopów i zwolnień, BHP, zmiany pracy i praw pracowniczych

source: For commercial reasons, it is not possible for the Citizens Information website to carry information about actual job vacancies, specific employment opportunities or information on careers in Ireland
pl: CitizensInformation,,e nie może zbierać informacji o faktycznych wolnych miejscach pracy, konkretnych możliwościach zatrudnienia lub informacji o możliwościach rozwoju zawodowego w Irlandii z przyczyn komercyjnych

source: The Citizens Information website cannot accept résumés/CVs or provide information on specific career paths
pl: CitizensInformation.ie nie przyjmuje życiorysów/CV ani nie może dostarczać informacji na temat konkretnych ścieżek rozwoju zawodowego

source: If you are applying for a job in Ireland through a recruitment agency, it's worth bearing in mind that it is very unusual that you are charged for these services
pl: Agencje rekrutujące pracowników w Irlandii zazwyczaj pobierają opłaty za usługi

source: When you apply for a job you need to have a curriculum vitae (CV) or resumé in English which is a summary or listing of your qualifications and work experience
pl: Przy składaniu podania o pracę należy mieć życiorys (curriculum vitae – CV) lub zwięzłe zestawienie (resumé) w języku angielskim, krótko przedstawiające lub wymieniające kwalifikacje i doświadczenie zawodowe

source: You also should have original copies of your qualifications and official copies of them in English
pl: Należy posiadać oryginały dokumentów poświadczających kwalifikacje i ich potwierdzone kopie w języku angielskim

source: If you are in Ireland and you need to have documents translated into English you can contact the embassy or consulate of your country for assistance
pl: Jeśli zainteresowana osoba przebywa w Irlandii i potrzebuje tłumaczenia dokumentów na język angielski może w sprawie pomocy skontaktować się z ambasadą lub konsulatem swojego kraju

source: Qualifications recognition: you can download a comparability statement for your qualification and a user guide (pdf) from qqi.ie
pl: Można wystąpić z wnioskiem o uznanie w Irlandii posiadanych kwalifikacji, korzystając z formularza wniosku Potwierdzanie kwalifikacji - Irlandia (pdf)

source: If you are seeking employment in Ireland, the job advertisement or recruitment agency will advise you how to apply for the job
pl: W przypadku starania się o zatrudnienie w Irlandii ogłoszenia dotyczące ofert pracy lub agencja rekrutacji doradzą, jak ubiegać się o daną pracę

source: If you are a non-EEA national you can find out more information about General Employment Permits and Critical Skills Employment Permits on the website of the Department of Jobs, Enterprise and Innovation
pl: Obywatele spoza EOG mogą znaleźć więcej informacji o zezwoleniach na zatrudnienie w Informatorze o pozwoleniach na pracę oraz Informatorze o Zielonych Kartach z Działem Zezwoleń na Zatrudnienie Ministerstwa Przedsiębiorczości, Handlu i Innowacja (Employment Permits section of the Department of Jobs, Enterprise and Innovation)

source: Contact information for recruitment agencies in Ireland is available in the telephone directory or through an online search
pl: Informacje kontaktowe dot. agencji rekrutacyjnych dostępne są na tzw. złotych stronach można je również znaleźć w sieci
